app/controllers/api/v1/tickets_controller.rb

  def index
    ticket = Ticket.all.order(created_at: :desc)
---
SELECT "tickets".* FROM "tickets" ORDER BY "tickets"."created_at" DESC

  def create
    ticket = Ticket.create!(ticket_params)
---
INSERT INTO "tickets" ("name", "email", "description", "response", "resolved", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "response" = $1, "resolved" = $2, "status" = $3, "updated_at" = $4 WHERE "tickets"."id" = $5  [["response", "fixed, new mouse added"], ["resolved", true], ["status", "Resolved"], ["updated_at", "2024-04-16 21:03:33.324548"], ["id", 5]]